/**
 * @description 工作经历
 */
export const experience=[
  {
    icon: 'mdi-map-marker-circle',
    text: '全栈测试工程师',
    content: {
      company: '梅特勒·托利多',
      dept: '商衡事业部(RTPO)',
      datetime: '2017-02~至今',
      desc: 'PC上位机包含Web版和桌面端以及云端，旨在PC端对嵌入式秤、PC秤进行数据管理，秤管理、各类自动化执行以及数据回传保存和生成报表以及复杂操作',
      todo: [
        '1.领导并推动MTStar和ScaleManager两款上位机软件的测试工作，同时积极参与Luban项目的测试任务',
        '2.负责规划与制定全面的测试计划，并有效地安排测试任务。编写详细的测试报告，汇总并释放相关文档，确保项目进度和质量得到有效控制',
        '3.设计并开发MTStar软件的自动化测试工具和脚本; 搭建上位机与电子秤联通的真实测试环境',
        '4.担任PO&MO售前售后的桥梁角色，针对国内外不同区域客户的需求提供专业的支持。积极推动新业务、项目的落地实施',
        '5.参与秤内自动化测试工具的维护和改进工作，提出并设计新的工具与脚本架构，进一步提高测试效率和产品质量',
        '6.负责开发秤内自动化测试的Visual Studio Code插件，并负责维护和改进插件的功能',
        '7.积极参与公司内部的技术分享和交流活动，促进团队间的学习与进步',
      ],
    },
  },
  {
    icon: 'mdi-map-marker-circle',
    text: '自动化测试工程师',
    content: {
      company: '江苏赞奇科技有限公司',
      dept: '测试部',
      datetime: '2015-08~2017-02',
      desc: '专业云平台，提供私有、公有云渲染服务,包含集群、客户端、web端控制台等软件',
      todo: [
        '1.主导云渲染平台的网站、后台管理网站、客户端和集群机的功能测试，确保产品功能的准确性和稳定性',
        '2.负责并推进云渲染平台自动化测试工具的开发与建设，为团队提供了高效的测试手段',
        '3.推进持续优化测试流程和工具工作，提高测试效率和产品质量',
      ],
    },
  },
  {
    icon: 'mdi-map-marker-circle',
    text: '测试主管、自动化测试工程师',
    content: {
      company: '无锡文思海辉',
      dept: 'GB1国内移动业务事业部, GB5欧美事业部',
      datetime: '2011-02~2015-08',
      desc: '国内最大的离岸服务外包公司; 游戏基地为江苏移动的移动端手机游戏APP商城; 展讯为展讯芯片兼容与APP测试; HP为HP scan自动化工具开发和自动化测试',
      todo: [
        '1.管理团队架构和规划，负责事业部内测试工程师的招聘、培训、任务分配、管理与考核。通过有效的人员管理和培养，提高团队的整体素质和工作效率',
        '2.制定事业部门内的测试验收标准，并协同项目经理编写标书、质量报告、绩效报告等文档，确保项目的顺利进行并满足客户的需求',
        '3.负责管理事业部内的移动设备资产，并提供技术支持。搭建WIFI测试环境和其他必要的测试环境，以确保产品的功能和性能得到充分验证',
        '4.主导事业部与各学校的校企合作、合作方公司、兼职人员的相关人员绩效考核，推动各方的质量保障提升',
        '5.带领团队参与多事业部的合作与协作项目，统筹与管理合作项目的各项事务，成功推动华为巴西电信项目实施',
        '6.在HP Print项目中负责自动化测试脚本开发工作，协调印度、美国两地的测试工程师研发沟通，确保项目的顺利进行',
        '7.领导HP Scan项目的整体自动化测试工具、脚本架构与设计工作，以及HP Scan产品的自动化测试工具和测试脚本的开发，成功推动HP scan项目组APP自动化测试的落地',
      ],
    },
  },
]