/**
 * @description 工作经历
 */
export const experience=[
  {
    icon: 'mdi-map-marker-circle',
    text: '全栈测试工程师',
    content: {
      company: '梅特勒·托利多',
      dept: '商衡事业部(RTPO)',
      datetime: '2017-02~至今',
      desc: 'PC上位机包含Web版和桌面端以及云端，旨在PC端对嵌入式秤、PC秤进行数据管理，秤管理、各类自动化执行以及数据回传保存和生成报表以及复杂操作',
      todo: [
        '1.牵头MTStar,ScaleManager两款上位机软件的测试工作;',
        '2.规划与制定测试计划; 安排测试任务; 编写测试报告并汇总研发&测试的最终释放文档;',
        '3.设计并开发MTStar软件的自动化测试脚本与执行工具, 搭建上位机与电子秤的实际测试环境;',
        '4.负责PO&MO的售前、售后衔接工作; 针对国内外不同区域的客户的需求提供售前、售后支持; 推动新业务、项目的落地;',
        '5.参与秤内自动化测试工具维护和改进, 提供新工具与新脚本架构的设计思路与Demo;',
        '6.参与公司内部项目技术分享以及交流。',
      ],
    },
  },
  {
    icon: 'mdi-map-marker-circle',
    text: '自动化测试工程师',
    content: {
      company: '江苏赞奇科技有限公司',
      dept: '测试部',
      datetime: '2015-08~2017-02',
      desc: '专业云平台，提供私有、公有云渲染服务,包含集群、客户端、web端控制台等软件',
      todo: [
        '1.负责云渲染平台的网站，后台管理网站，客户端和集群机的功能测试;',
        '2.负责和建设云渲染平台的自动化测试工具开发。',
      ],
    },
  },
  {
    icon: 'mdi-map-marker-circle',
    text: '测试主管、自动化测试工程师',
    content: {
      company: '无锡文思海辉',
      dept: 'GB1国内移动业务事业部, GB5欧美事业部',
      datetime: '2011-02~2015-08',
      desc: '国内最大的离岸服务外包公司; 游戏基地为江苏移动的移动端手机游戏APP商城; 展讯为展讯芯片兼容与APP测试; HP为HP scan自动化工具开发和自动化测试',
      todo: [
        /*
         *  // todo  突出管理方面的优势
         * */
        '1.负责管理团队的架构、规划与人员规划; 对事业部内的测试工程师进行日常招聘、培训、任务分配、管理与考核;',
        '2.负责制定事业部门内测试验收标注; 协同PM编写标书、各类质量报表、绩效报表、年表等提交客户;',
        '3.负责管理事业部内的移动设备资产, 提供技术支持，例如各安卓机型版本升降级; 搭建WIFI测试环境和其他必要的测试环境;',
        '4.负责事业部与各学校的校企合作、合作方公司、兼职人员的相关人员绩效考核; 推动各合作方的质量保障提升;',
        '5.负责带领团队参与多事业部的合作与协作项目, 统筹与管理合作项目的各项事务,成功推动华为巴西电信项目成功实施; ',
        '6.负责HP print项目的自动化测试脚本开发工作, 协调印度、美国两地的测试工程师研发沟通工作;',
        '7.领导HP scan项目的整体自动化测试工具、脚本架构与设计工作; 领导开发HP scan产品的自动化测试工具和测试脚本, 推动HP scan项目组APP自动化测试成功落地。',
      ],
    },
  },
]